import 'package:flutter/material.dart';

const kBackgroundColor = Color(0xff10497A);
const textColor = Colors.white;
const textColor2 = Colors.black;
const kBackgroundColor2 = Color(0xff03C4CB);
const avatarColor = Color(0xff115A44);
const kBackgroundColor3 = Color(0xffF2FCFB);
const kBackgroundColor4 = Color(0xff9E9E9E);
// const kBackgroundColor5 = Color(0xff10497A);
const String publicUrl = 'tcb.dev-asha9.com';
// const String baseUrl = 'https://uat.bcc.ac.th:8443';

List<Map<String, String>> cardItems = [
  {
    'date': '18/10/2567',
    'hospital': 'สถาบันมะเร็งแห่งชาติ',
    'diagnosis':
        'C20: Malignant neoplasm of the rectum, which is a type of colorectal cancer characterized by the uncontrolled and abnormal proliferation of malignant epithelial cells in the rectal mucosa, often leading to invasive growth into adjacent tissues and potential metastasis to regional lymph nodes, the liver, lungs, or other distant organs through hematogenous or lymphatic spread.',
    'rectum':
        'rectum (เนื้องอกร้ายที่ลำไส้ใหญ่ส่วนตรง (เร็คตัม) ซึ่งเป็นความผิดปกติของเซลล์ที่แบ่งตัวอย่างควบคุมไม่ได้ ทำให้เกิดก้อนเนื้อที่อาจแพร่กระจายไปยังอวัยวะข้างเคียงหรือส่วนอื่นของร่างกาย หากไม่ได้รับการรักษาอย่างทันท่วงที)',
  },
  {
    'date': '26/07/2567',
    'hospital': 'สถาบันมะเร็งแห่งชาติ',
    'diagnosis':
        'C20:  Malignant neoplasm of the rectum, which is a type of colorectal cancer characterized by the uncontrolled and abnormal proliferation of malignant epithelial cells in the rectal mucosa, often leading to invasive growth into adjacent tissues and potential metastasis to regional lymph nodes, the liver, lungs, or other distant organs through hematogenous or lymphatic spread',
    'rectum':
        'rectum (เนื้องอกร้ายที่ลำไส้ใหญ่ส่วนตรง (เร็คตัม) ซึ่งเป็นความผิดปกติของเซลล์ที่แบ่งตัวอย่างควบคุมไม่ได้ ทำให้เกิดก้อนเนื้อที่อาจแพร่กระจายไปยังอวัยวะข้างเคียงหรือส่วนอื่นของร่างกาย หากไม่ได้รับการรักษาอย่างทันท่วงที)',
  },
  {
    'date': '09/07/2567',
    'hospital': 'สถาบันมะเร็งแห่งชาติ',
    'diagnosis': 'C20: Malignant neoplasm of rectum',
    'rectum': 'rectum (เนื้องอกร้ายที่ลำไส้ใหญ่ส่วนตรง(เร็คตัม))',
  },
  {
    'date': '09/07/2567',
    'hospital': 'สถาบันมะเร็งแห่งชาติ',
    'diagnosis': 'C20: Malignant neoplasm of rectum',
    'rectum': 'rectum (เนื้องอกร้ายที่ลำไส้ใหญ่ส่วนตรง(เร็คตัม))',
  },
  {
    'date': '09/07/2567',
    'hospital': 'สถาบันมะเร็งแห่งชาติ',
    'diagnosis': 'C20: Malignant neoplasm of rectum',
    'rectum': 'rectum (เนื้องอกร้ายที่ลำไส้ใหญ่ส่วนตรง(เร็คตัม))',
  },
  {
    'date': '09/07/2567',
    'hospital': 'สถาบันมะเร็งแห่งชาติ',
    'diagnosis': 'C20: Malignant neoplasm of rectum',
    'rectum': 'rectum (เนื้องอกร้ายที่ลำไส้ใหญ่ส่วนตรง(เร็คตัม))',
  },
  {
    'date': '09/07/2567',
    'hospital': 'สถาบันมะเร็งแห่งชาติ',
    'diagnosis': 'C20: Malignant neoplasm of rectum',
    'rectum': 'rectum (เนื้องอกร้ายที่ลำไส้ใหญ่ส่วนตรง(เร็คตัม))',
  },
  {
    'date': '09/07/2567',
    'hospital': 'สถาบันมะเร็งแห่งชาติ',
    'diagnosis': 'C20: Malignant neoplasm of rectum',
    'rectum': 'rectum (เนื้องอกร้ายที่ลำไส้ใหญ่ส่วนตรง(เร็คตัม))',
  },
  {
    'date': '09/07/2567',
    'hospital': 'สถาบันมะเร็งแห่งชาติ',
    'diagnosis': 'C20: Malignant neoplasm of rectum',
    'rectum': 'rectum (เนื้องอกร้ายที่ลำไส้ใหญ่ส่วนตรง(เร็คตัม))',
  },
  {
    'date': '09/07/2567',
    'hospital': 'สถาบันมะเร็งแห่งชาติ',
    'diagnosis': 'C20: Malignant neoplasm of rectum',
    'rectum': 'rectum (เนื้องอกร้ายที่ลำไส้ใหญ่ส่วนตรง(เร็คตัม))',
  },
];
final List<String> items = ['โรงพยาบาล', 'โรงพยาบาลมหาวิทยาลัยนวมินทราธิราช ศูนย์การแพทย์วิภาวดีรังสิต'];

List<Map<String, String>> cardNews = [
  {
    'date': '18/10/2567',
    'title': 'สถาบันมะเร็งแห่งชาติ',
    'detail':
        'C20: Malignant neoplasm of the rectum, which is a type of colorectal cancer characterized by the uncontrolled and abnormal proliferation of malignant epithelial cells in the rectal mucosa, often leading to invasive growth into adjacent tissues and potential metastasis to regional lymph nodes, the liver, lungs, or other distant organs through hematogenous or lymphatic spread.',
  },
  {
    'date': '18/10/2567',
    'title': 'สถาบันมะเร็งแห่งชาติ',
    'detail':
        'C20: Malignant neoplasm of the rectum, which is a type of colorectal cancer characterized by the uncontrolled and abnormal proliferation of malignant epithelial cells in the rectal mucosa, often leading to invasive growth into adjacent tissues and potential metastasis to regional lymph nodes, the liver, lungs, or other distant organs through hematogenous or lymphatic spread.',
  },
];

// นโยบาย
String message = '''
   ผู้ขอใช้บริการตกลงใช้บริการอิเล็กทรอนิกส์ของกรมการแพทย์ กระทรวงสาธารณสุขตามที่ ได้รับอนุมัติจากกรมการแพทย์ กระทรวงสาธารณสุข และตามรายละเอียดการให้บริการที่กรมการแพทย์ กระทรวงสาธารณสุขกำหนด โดยผู้ขอใช้บริการตกลงผูกพันตามข้อกำหนดและเงื่อนไข ดังต่อไปนี้
   1.คำนิยาม
   1.1 "ข้อมูลส่วนบุคคล" หมายความถึง ข้อมูลส่วน
บุคคล และ/หรือ ข้อมูลใด ๆ ของผู้ขอ ใช้บริการที่ผู้ขอใช้บริการได้ให้ไว้แก่กรมการแพทย์ กระทรวงสาธารณสุขและ/หรือ ที่มีอยู่ในระบบฐานข้อมูลของกรมการแพทย์กระทรวงสาธารณสุข และ/หรือที่กรมการแพทย์ กระทรวงสาธารณสุข เก็บรวบรวมมาจากบุคคลอื่นใด
   1.2 "เครื่องมือเพื่อการทำรายการ" หมายความถึงเครื่องคอมพิวเตอร์ และ/หรือ โทรศัพท์มือถือ และ/หรือแท็บเล็ต และ/หรือ เครื่องมืออื่นใดตามที่กรมการแพทย์กระทรวงสาธารณสุข กำหนดเพื่อการทำรายการ
   1.3 "กรมการแพทย์ กระทรวงสาธารณสุข" หมายความ ถึง กรมการแพทย์ กระทรวงสาธารณสุข กรมการแพทย์และให้หมายความรวมถึงบุคคลที่กรมการแพทย์กระทรวงสาธารณสุข มอบหมายด้วย
   1.4 "บริการอิเล็กทรอนิกส์" หมายความถึง การให้บริการข้อมูลและการทำธุรกรรมผ่านระบบเครือข่าย อินเตอร์เน็ต รวมถึงบริการทางอิเล็กทรอนิกส์ประเภทอื่นใดที่กรมการแพทย์ กระทรวงสาธารณสุข จะเปิดให้บริการแก่ผู้ขอใช้บริการเพิ่มเติมในภายหน้า
   1.5 "เหตุสุดวิสัย" หมายความถึง เหตุใด ๆ อันอยู่นอกเหนือการควบคุมของกรมการแพทย์ กระทรวงสาธารณสุข ซึ่งเป็นอุปสรรคต่อการให้บริการตามข้อกำหนดและเงื่อนไขนี้ รวมถึงเป็นเหตุให้เกิดข้อขัดข้อง หรือข้อมูลผิดพลาด เช่น ระบบคอมพิวเตอร์ของกรมการแพทย์กระทรวงสาธารณสุข หรือระบบสื่อสารขัดข้องเพราะกระแสไฟฟ้าขัดข้อง หรือปัญหาด้านพลังงาน การกระทำของบุคคลภายนอก ไวรัสคอมพิวเตอร์ หรือข้อมูลที่เป็น อันตรายต่าง ๆ (Harmful Data) ซึ่งเหตุดังกล่าวไม่ได้มีสาเหตุมาจากการที่กรมการแพทย์ กระทรวงสาธารณสุขไม่ดูแลรักษาระบบคอมพิวเตอร์อย่างเพียงพอตาม
มาตรฐาน
   1.6 "อุปกรณ์เพื่อการทำรายการ" หมายความถึง อุปกรณ์สำหรับผู้ขอใช้บริการใช้ประกอบ หรือใช้ร่วมในการ ทำรายการเพื่อการใช้บริการอิเล็กทรอนิกส์ตามที่กรมการแพทย์ กระทรวงสาธารณสุข เห็นชอบ เช่น เครื่อง มือสร้างและแปลงรหัส (Token) หรืออุปกรณ์อื่นใดที่ทำหน้าที่ในลักษณะทำนองเดียวกัน
การใช้และการเก็บรักษารหัสประจำตัว ข้อมูลส่วน บุคคล และเครื่องมือเพื่อการ 
   2.ทำรายการ
   2.1 ผู้ขอใช้บริการต้องเก็บรักษาเครื่องมือเพื่อการทำรายการไว้เป็นอย่างดีในที่ปลอดภัย และผู้ขอใช้บริการ ต้องไม่ทำให้เครื่องมือเพื่อการทำรายการดังกล่าวตกอยู่ภายใต้การครอบครองของบุคคลอื่น
   2.2 กรณีที่รหัสประจำตัว หรืออุปกรณ์เพื่อการทำรายการของผู้ขอใช้บริการ ชำรุด สูญหาย หรือถูกโจรกรรม ผู้ขอใช้บริการต้องแจ้ง และ/หรือ ขอระงับ ธุรกรรม และ/หรือ การใช้บริการอิเล็กทรอนิกส์ใด ๆและ/หรือ ขออายัดหรือระงับการใช้รหัสประจำตัวหรือ อุปกรณ์เพื่อการทำรายการดังกล่าวทันที ที่ Call Center
โทร 0-2590-6000 โดยจะดำเนินการระงับ การใช้บริการ อิเล็กทรอนิกส์ใด ๆ และ/หรือ อายัดหรือระงับการใช้รหัสประจำตัวหรืออุปกรณ์เพื่อการทำรายการดังกล่าวในทันทีที่ผู้ขอใช้บริการผ่านกระบวนการตรวจสอบความเป็นเจ้าของบัญชีตามขั้นตอนและวิธีการที่ กรมการแพทย์กระทรวงสาธารณสุข กำหนดแล้ว ทั้งนี้ ผู้ขอใช้บริการยอมรับว่าการทำธุรกรรมใด ๆ หรือการใช้บริการ อิเล็กทรอนิกส์ผ่านรหัสประจำตัวหรืออุปกรณ์เพื่อการทำรายการของผู้ใช้บริการก่อนที่กรมการแพทย์ กระทรวงสาธารณสุข จะได้ทำการระงับธุรกรรม และ/หรือ การใช้บริการอิเล็กทรอนิกส์นั้น ๆ และ/หรือ อายัดหรือระงับการใช้รหัสประจำตัวหรืออุปกรณ์เพื่อการทำรายการดังกล่าว
นั้น ให้มีผลผูกพันผู้ขอใช้บริการ และผู้ขอใช้บริการตกลง รับผิดชอบทุกประการ
   การเข้าใช้บริการระบบอิเล็กทรอนิกส์ของกรมการแพทย์ 
   3.กระทรวงสาธารณสุข
   3.1 ผู้ขอใช้บริการสามารถใช้บริการอิเล็กทรอนิกส์แต่ละประเภทได้ต่อเมื่อผู้ขอใช้บริการได้จัดทำข้อตกลงการใช้บริการ และ/หรือ ดำเนินการใด ๆ ตามที่กรมการแพทย์ กระทรวงสาธารณสุข กำหนด รวมทั้งได้รับอนุมัติจากกรมการแพทย์ กระทรวงสาธารณสุข ให้เป็นผู้ใช้บริการแต่ละประเภทนั้น ๆ ด้วย โดยผู้ขอใช้บริการต้อง ผูกพันและปฏิบัติตามข้อกำหนดและเงื่อนไขการใช้บริการ ที่กรมการแพทย์ กระทรวงสาธารณสุข กำหนดขึ้นสำหรับการใช้บริการแต่ละประเภทดังกล่าว และ/หรือ ข้อกำหนดและเงื่อนไขการใช้บริการตามแต่ละประเภทรายการที่ปรากฏขึ้นก่อน และ/หรือ ระหว่างที่ผู้ขอใช้บริการทำรายการ (ถ้ามี) ด้วย ทั้งนี้ ให้ถือว่าข้อตกลง ข้อกำหนดและเงื่อนไขการใช้บริการดังกล่าว เป็นส่วนหนึ่งของข้อกำหนดและเงื่อนไขการใช้บริการนี้ด้วย
   3.2 ในการเข้าใช้บริการอิเล็กทรอนิกส์ ผู้ขอใช้บริการ ต้องใส่รหัสประจำตัวให้ถูกต้อง พร้อมปฏิบัติตามขั้นตอน
วิธีการ และเงื่อนไขการใช้บริการที่กรมการแพทย์กระทรวงสาธารณสุข กำหนดอย่างถูกต้องครบถ้วนทุกครั้งและหากใส่รหัสประจำตัวไม่ถูกต้องเกินจำนวนครั้งที่กรม
การแพทย์ กระทรวงสาธารณสุข กำหนด (แล้วแต่กรณี)
ระบบจะระงับการให้บริการชั่วคราว โดยผู้ขอใช้บริการ ต้องติดต่อที่ กรมการแพทย์ กระทรวงสาธารณสุข หรือแจ้งที่ Call Center โทร 0-2590-6000 ในกรณีที่มีความเสียหายใด ๆ เกิดขึ้นแก่กรมการแพทย์ กระทรวงสาธารณสุข และ/หรือ บุคคลใด ๆ เนื่องจากการให้บริการหรือการดำเนินการใด ๆ ตามความประสงค์ของผู้ขอใช้บริการตามข้อกำหนดและเงื่อนไขนี้โดยมิใช่ความผิดของกรมการแพทย์ กระทรวงสาธารณสุข หรือในกรณีที่ผู้ขอใช้บริการใช้บริการเพื่อกิจการใดซึ่งขัดต่อกฎหมายหรือความสงบเรียบร้อยหรือศีลธรรมอันดีของ ผู้ขอใช้บริการตกลงยินยอมรับผิดชอบชดใช้บรรดาค่าเสียหายต่างๆ ที่
เกิดขึ้นทั้งหมดทุกประการ
   3.3 ผู้ขอใช้บริการตกลงยอมรับผูกพันและปฏิบัติตามระเบียบ ข้อกำหนดและเงื่อนไข รวมถึงคู่มือ และเอกสารอธิบายวิธีการใช้บริการอิเล็กทรอนิกส์ตามที่กรมการแพทย์ กระทรวงสาธารณสุข กำหนด ซึ่งผู้ขอใช้บริการได้รับหรือถือว่าได้รับไว้แล้วในวันที่ทำคำขอใช้บริการ รวม ทั้งตามที่กรมการแพทย์ กระทรวงสาธารณสุข จะได้กำหนดเพิ่มเติม แก้ไข หรือเปลี่ยนแปลงในภายหน้า ซึ่งให้ถือเป็นส่วนหนึ่งของข้อกำหนดและเงื่อนไขนี้ด้วย
   4.การดำเนินการกรณีพบข้อผิดพลาด 
ในกรณีที่ผู้ขอใช้บริการพบว่ามีข้อผิดพลาดหรือมีความผิดปกติใด ๆ ในการใช้บริการอิเล็กทรอนิกส์ ผู้ขอใช้บริการจะต้องแจ้งให้กรมการแพทย์ กระทรวงสาธารณสุข ทราบโดยเร็วที่ Call Center โทร 0-2590-6000 โดยอย่างน้อยต้องแจ้งข้อมูลเกี่ยวกับวันและเวลาที่ทำรายการ รวมทั้งข้อมูลอื่นใดที่เกี่ยวกับการทำรายการที่มีข้อผิดพลาดดังกล่าวตามที่กรมการแพทย์ กระทรวงสาธารณสุข กำหนดโดยกรมการแพทย์ กระทรวงสาธารณสุข และผู้ขอใช้บริการจะร่วมมือ กันดำเนินการตรวจสอบข้อเท็จจริงและสอบสวนหาสาเหตุของข้อผิดพลาด รวมถึงแก้ไขข้อผิดพลาดดังกล่าวโดยเร็ว ทั้งนี้จะแจ้งผลการดำเนินการให้ผู้ขอใช้บริการทราบตาม
วิธีการและช่องทางที่กรมการแพทย์ กระทรวงสาธารณสุขเห็นสมควร เช่น ทางโทรศัพท์ หรือไปรษณีย์ หรือทางเห็นสมควร เช่น ทางโทรศัพท์ หรือไปรษณีย์ หรือทางจดหมายอิเล็กทรอนิกส์ (E-mail) หรือโดยวิธีการและช่องทางอื่นใด ที่ กรมการแพทย์ กระทรวงสาธารณสุข จะได้กำหนดเพิ่มเติม
   5.ความรับผิดชอบและข้อยกเว้นความรับผิดของกรมการแพทย์ กระทรวงสาธารณสุข
   5.1 บรรดาการกระทำใด ๆ ที่กรมการแพทย์ กระทรวงสาธารณสุข ได้กระทำไปตามข้อกำหนดและเงื่อนไขนี้และ/หรือ ตามข้อมูลที่ผู้ขอใช้บริการได้แจ้งต่อกรมการแพทย์ กระทรวงสาธารณสุข และ/หรือ ตามคำร้องขอของ ผู้ขอใช้บริการ และ/หรือ ตามข้อกำหนดและเงื่อนไขการใช้บริการใดๆ ของกรมการแพทย์ กระทรวงสาธารณสุขไม่ว่าที่มีอยู่แล้วในขณะนี้หรือที่จะมีขึ้นภายหน้า ให้มีผล ผูกพันผู้ขอใช้บริการทุกประการและกรมการแพทย์กระทรวงสาธารณสุข ไม่ต้องรับผิดชอบในความเสียหายใด ๆ อันเกิดขึ้นแก่ผู้ขอใช้บริการ และ/หรือ บุคคลใดๆไม่ว่าจะโดยประการใดทั้งสิ้น เว้นแต่เกิดจากกรมการแพทย์ กระทรวงสาธารณสุข จงใจ หรือประมาทเลินเล่ออย่างร้ายแรงไม่ปฏิบัติตามคำขอใช้บริการ
   5.2 ในกรณีที่กรมการแพทย์ กระทรวงสาธารณสุข ได้ให้บริการ หรืองดเว้นการให้บริการใด ๆ แก่ผู้ขอใช้บริการ เมื่อเกิดกรณีอย่างใดอย่างหนึ่งดังต่อไปนี้ ผู้ขอใช้
บริการตกลงว่ากรมการแพทย์ กระทรวงสาธารณสุข ไม่ต้องรับผิดชอบต่อผู้ขอใช้บริการ และ/หรือ บุคคลใดทั้ง สิ้น (1) ผู้ขอใช้บริการไม่ปฏิบัติหรือปฏิบัติข้อกำหนด และเงื่อนไขหรือข้อตกลงกับกรมการแพทย์ กระทรวงสาธารณสุข (2) เป็นเหตุสุดวิสัย
   6.การระงับ และ/หรือ การยกเลิกการให้บริการ กรมการแพทย์ กระทรวงสาธารณสุข
   บริการ หรือระงับ หรือยกเลิกการให้บริการอิเล็กทรอนิกส์ประเภทหนึ่งประเภทใด หรือทั้งหมด เมื่อใดก็ได้ โดยแจ้งให้ผู้ขอใช้บริการทราบล่วงหน้าไม่น้อยกว่า 15 วัน เว้นแต่กรณีที่กรมการแพทย์ กระทรวงสาธารณสุข เห็นว่าการดำเนินการตามข้อกำหนดและเงื่อนไขการใช้บริการนี้ หรือกิจการหรือการดำเนินกิจการของผู้ขอใช้บริการอาจเป็นการขัด ต่อกฎหมาย หรือความสงบเรียบร้อย หรือศีลธรรมอันดีของประชาชน หรือมีพฤติการณ์อันน่าเชื่อว่ามีการใช้บริการหรือการทำรายการในลักษณะ Robot หรือโดย ทุจริตหรือโดยมิชอบไม่ว่าด้วยประการใด ๆ หรือมีเหตุจำเป็นอื่นใดซึ่งไม่อาจแจ้งล่วงหน้าได้ กรมการแพทย์กระทรวงสาธารณสุข จะแจ้งให้ผู้ขอใช้บริการทราบโดยเร็ว
   7.การบันทึกและการเปิดเผยข้อมูล ผู้ขอใช้บริการรับทราบและตกลงให้กรมการแพทย์ กระทรวงสาธารณสุข
   ทราบและตกลงให้กรมการแพทย์ กระทรวงสาธารณสุขสามารถทำการบันทึกบทสนทนาระหว่าง ผู้ขอใช้บริการ กับกรมการแพทย์ กระทรวงสาธารณสุข และ/หรือ จัดเก็บและ/หรือ บันทึก และ/หรือ ประมวลผลข้อมูลเกี่ยวกับ ผู้ขอใช้บริการ และ/หรือ รายการการใช้บริการ และ/หรือการดำเนินการใด ๆ ที่เกี่ยวข้องกับการใช้บริการของผู้ขอใช้บริการเพื่อประโยชน์ในการปรับปรุงการบริการของกรมการแพทย์ กระทรวงสาธารณสุข และ/หรือ เพื่อการใด ๆ
   ได้ตามที่กรมการแพทย์ กระทรวงสาธารณสุข เห็นสมควรและเพื่อเป็นหลักฐานการบริการและรายการใช้บริการ แต่ทั้งนี้ กรมการแพทย์ กระทรวงสาธารณสุข ไม่มีหน้าที่ต้องทำ หรือเก็บรักษาบันทึกบทสนทนา และ/หรือข้อมูลดังกล่าว ทั้งนี้ ผู้ขอใช้บริการตกลงให้ความยินยอมในการยอมรับบันทึกการสนทนาและข้อมูลดังกล่าวเป็นพยานหลักฐานและยืนยันผู้ขอใช้บริการและให้ กรมการแพทย์กระทรวงสาธารณสุข ใช้บันทึกการสนทนาและข้อมูลดังกล่าวในกระบวนพิจารณาใด ๆ หรือ ตามที่กรมการแพทย์กระทรวงสาธารณสุข เห็นสมควร
   8.กฎหมายที่ใช้บังคับ ข้อกำหนดและเงื่อนไขการใช้บริการนี้ให้ใช้บังคับและตีความตามกฎหมายไทย และให้ศาลไทยเป็นศาลที่มีเขตอำนาจในการพิจารณาข้อพิพาท ที่เกิดขึ้นเกี่ยวกับการใช้บริการตามข้อกำหนดและเงื่อนไขการใช้บริการนี้ ปรกาศ ณ วันที่ 19/04/2562


''';

double width(BuildContext context) => MediaQuery.of(context).size.width;
double height(BuildContext context) => MediaQuery.of(context).size.height;

// onTap: () async {
//                 await showDialog(
//                     context: context,
//                     builder: (context) => Dialogyesno(
//                           title: 'แจ้งเตือน',
//                           description: 'Test',
//                           pressYes: () {
//                             Navigator.pop(context);
//                           },
//                           pressNo: () {
//                             Navigator.pop(context);
//                           },
//                           bottomNameYes: 'ตกลง',
//                           bottomNameNo: 'ยกเลิก',
//                         ));
//               },

